tap "homebrew/bundle"
tap "homebrew/services"
tap "samzong/tap"
tap "trntv/sshed"
brew "asciinema"
brew "autojump"
brew "batt"
brew "chsrc"
brew "dive"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-extras"
brew "glab"
brew "pinentry"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "helm"
brew "htop"
brew "huggingface-cli"
brew "jq"
brew "just"
brew "k9s"
brew "kind"
brew "kubebuilder"
brew "kubernetes-cli"
brew "libomp"
brew "llm"
brew "mas"
brew "minikube"
brew "nushell"
brew "nvm"
brew "openjdk@17"
brew "pandoc"
brew "pinentry-mac"
brew "pipx"
brew "pnpm"
brew "protobuf"
brew "ruff"
brew "speedtest-cli"
brew "stern"
brew "swiftlint"
brew "tmux"
brew "trash"
brew "tree"
brew "uv"
brew "vim"
brew "wget"
brew "yq"
brew "yt-dlp"
brew "samzong/tap/mdctl"
cask "android-studio"
cask "apifox"
cask "basictex"
cask "betterdisplay"
cask "bilibili"
cask "chatgpt"
cask "clash-verge-rev"
cask "claude"
cask "cursor"
cask "daisydisk"
cask "dingtalk"
cask "discord"
cask "docker"
cask "drawio"
cask "feishu"
cask "figma"
cask "follow"
cask "font-noto-sans-cjk"
cask "font-roboto-mono-for-powerline"
cask "google-chrome"
cask "google-drive"
cask "handbrake"
cask "hf-model-downloader"
cask "input-source-pro"
cask "iterm2"
cask "jordanbaird-ice"
cask "logitech-options"
cask "mac-music-player"
cask "maccy"
cask "microsoft-auto-update"
cask "microsoft-word"
cask "obsidian"
cask "ollama"
cask "pearcleaner"
cask "raycast"
cask "shimo"
cask "slack"
cask "steam"
cask "telegram"
cask "tencent-meeting"
cask "ticktick"
cask "visual-studio-code"
cask "wechat"
cask "wpsoffice-cn"
cask "zoom"
mas "Bob", id: 1630034110
mas "Keynote", id: 409183694
mas "Xcode", id: 497799835
vscode "batisteo.vscode-django"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hex-ci.stylelint-plus"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "kevinrose.vsc-python-indent"
vscode "mkxml.vscode-filesize"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "msjsdiag.vscode-react-native"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "planbcoding.vscode-react-refactor"
vscode "saoudrizwan.claude-dev"
vscode "sdras.night-owl"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vue.volar"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
