tap "a7ex/formulae"
tap "cncf/landscape2"
tap "filosottile/musl-cross"
tap "samzong/tap"
tap "sst/tap"
tap "tw93/tap"
brew "asciinema"
brew "aspell"
brew "autocorrect"
brew "autojump"
brew "batt", restart_service: :changed
brew "chsrc"
brew "cmake"
brew "colima", restart_service: :changed
brew "direnv"
brew "diskonaut"
brew "dive"
brew "fdupes"
brew "ffmpeg"
brew "func-e"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-extras"
brew "glab"
brew "gnu-sed"
brew "pinentry"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "goreleaser"
brew "gping"
brew "helm"
brew "htop"
brew "huggingface-cli"
brew "hugo"
brew "jq"
brew "just"
brew "k9s"
brew "kind"
brew "kubebuilder"
brew "kubectl-ai"
brew "kubernetes-cli"
brew "libomp"
brew "llvm"
brew "make"
brew "makensis"
brew "markdownlint-cli"
brew "markdownlint-cli2"
brew "mas"
brew "mihomo"
brew "minio-mc"
brew "miniserve"
brew "ncdu"
brew "nushell"
brew "nvm"
brew "onefetch"
brew "openjdk@17"
brew "pandoc"
brew "periphery"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "pnpm"
brew "pre-commit"
brew "protobuf"
brew "qshell"
brew "ripgrep"
brew "ruff"
brew "semgrep"
brew "specify"
brew "stern"
brew "swiftformat"
brew "swiftgen"
brew "swiftlint"
brew "tmux"
brew "trash"
brew "tree"
brew "trivy"
brew "uv"
brew "vim"
brew "wget"
brew "xcbeautify"
brew "xcode-build-server"
brew "yq"
brew "yt-dlp"
brew "a7ex/formulae/xcresultparser"
brew "cncf/landscape2/landscape2"
brew "filosottile/musl-cross/musl-cross"
brew "samzong/tap/gmc"
brew "samzong/tap/gofs"
brew "samzong/tap/mdctl"
brew "samzong/tap/mm"
brew "tw93/tap/mole"
cask "android-studio"
cask "apifox"
cask "arc"
cask "basictex"
cask "betterdisplay"
cask "bilibili"
cask "capcut"
cask "chatgpt"
cask "clash-verge-rev"
cask "claude"
cask "codex"
cask "configforge"
cask "container"
cask "dingtalk"
cask "discord"
cask "docker-desktop"
cask "drawio"
cask "feishu"
cask "figma"
cask "folo"
cask "font-fira-code"
cask "font-google-sans-code"
cask "font-hack"
cask "font-noto-sans-cjk"
cask "font-roboto-mono-for-powerline"
cask "font-ubuntu-mono"
cask "ghostty"
cask "github@beta"
cask "goland"
cask "google-chrome"
cask "google-drive"
cask "handbrake-app"
cask "headlamp"
cask "hf-model-downloader"
cask "iterm2"
cask "lark"
cask "lm-studio"
cask "logitech-options"
cask "logo-wallpaper"
cask "maccy"
cask "microsoft-auto-update"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "microsoft-word"
cask "notion"
cask "obsidian"
cask "pearcleaner"
cask "prompts"
cask "pronotes"
cask "pycharm"
cask "raycast"
cask "saveeye"
cask "sequel-ace"
cask "shimo"
cask "slack"
cask "telegram"
cask "tencent-meeting"
cask "ticktick"
cask "trae"
cask "typora"
cask "visual-studio-code@insiders"
cask "wechat"
cask "zed"
cask "zoom"
mas "Bitwarden", id: 1352778147
mas "Bob", id: 1630034110
mas "Developer", id: 640199958
mas "Keynote", id: 409183694
mas "Microsoft PowerPoint", id: 462062816
mas "MWeb Pro 2", id: 1403919533
mas "Shadowrocket", id: 932747118
vscode "anthropic.claude-code"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "ms-azuretools.vscode-containers"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "openai.chatgpt"
vscode "redhat.vscode-yaml"
