tap "cncf/landscape2"
tap "filosottile/musl-cross"
tap "samzong/tap"
tap "sst/tap"
brew "act"
brew "aichat"
brew "aider"
brew "asciinema"
brew "aspell"
brew "autocorrect"
brew "autojump"
brew "batt", restart_service: :changed
brew "chsrc"
brew "ripgrep"
brew "codex"
brew "direnv"
brew "diskonaut"
brew "dive"
brew "dufs"
brew "fdupes"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-extras"
brew "glab"
brew "gnu-sed"
brew "pinentry"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "goreleaser"
brew "gping"
brew "helm"
brew "htop"
brew "huggingface-cli"
brew "hugo"
brew "jq"
brew "just"
brew "k9s"
brew "kind"
brew "kubebuilder"
brew "kubernetes-cli"
brew "libomp"
brew "llvm"
brew "make"
brew "makensis"
brew "markdownlint-cli"
brew "markdownlint-cli2"
brew "mas"
brew "minio-mc"
brew "miniserve"
brew "ncdu"
brew "nushell"
brew "nvm"
brew "onefetch"
brew "openjdk@17"
brew "pandoc"
brew "periphery"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "pnpm"
brew "protobuf"
brew "qshell"
brew "ruff"
brew "semgrep"
brew "speedtest-cli"
brew "stern"
brew "swiftformat"
brew "swiftgen"
brew "swiftlint"
brew "tmux"
brew "trash"
brew "tree"
brew "uv"
brew "vim"
brew "wget"
brew "xcbeautify"
brew "xcode-build-server"
brew "yq"
brew "yt-dlp"
brew "cncf/landscape2/landscape2"
brew "filosottile/musl-cross/musl-cross"
brew "samzong/tap/gmc"
brew "samzong/tap/gofs"
brew "samzong/tap/mdctl"
brew "samzong/tap/mm"
brew "sst/tap/opencode"
cask "android-studio"
cask "anythingllm"
cask "apifox"
cask "arc"
cask "basictex"
cask "betterdisplay"
cask "bilibili"
cask "chatgpt"
cask "claude"
cask "configforge"
cask "container"
cask "daisydisk"
cask "dingtalk"
cask "discord"
cask "docker-desktop"
cask "drawio"
cask "feishu"
cask "figma"
cask "folo"
cask "font-fira-code"
cask "font-google-sans-code"
cask "font-hack"
cask "font-noto-sans-cjk"
cask "font-roboto-mono-for-powerline"
cask "goland"
cask "google-chrome"
cask "google-drive"
cask "grandperspective"
cask "handbrake-app"
cask "headlamp"
cask "hf-model-downloader"
cask "input-source-pro"
cask "iterm2"
cask "jordanbaird-ice"
cask "lark"
cask "lm-studio"
cask "logitech-options"
cask "mac-music-player"
cask "maccy"
cask "microsoft-auto-update"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "microsoft-word"
cask "obsidian"
cask "pearcleaner"
cask "prompts"
cask "pronotes"
cask "pycharm"
cask "raycast"
cask "saveeye"
cask "sequel-ace"
cask "shimo"
cask "slack"
cask "steam"
cask "telegram"
cask "tencent-meeting"
cask "ticktick"
cask "trae"
cask "typora"
cask "visual-studio-code"
cask "warp"
cask "wechat"
cask "xcodes-app"
cask "zed"
cask "zoom"
mas "Bob", id: 1630034110
mas "Developer", id: 640199958
mas "Microsoft PowerPoint", id: 462062816
mas "Musicer", id: 6745227444
mas "MWeb Pro 2", id: 1403919533
mas "Xcode", id: 497799835
vscode "andrepimenta.claude-code-chat"
vscode "anthropic.claude-code"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "heisebaiyun.kiro-for-cc"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "kevinrose.vsc-python-indent"
vscode "mkxml.vscode-filesize"
vscode "mohdzaid.kiro-theme"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "msjsdiag.vscode-react-native"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "planbcoding.vscode-react-refactor"
vscode "sdras.night-owl"
vscode "streetsidesoftware.code-spell-checker"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vue.volar"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "zhixiangzhang.mdlint"
