batisteo.vscode-django
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dsznajder.es7-react-js-snippets
esbenp.prettier-vscode
formulahendry.auto-rename-tag
github.copilot
github.copilot-chat
hex-ci.stylelint-plus
inferrinizzard.prettier-sql-vscode
kevinrose.vsc-python-indent
mkxml.vscode-filesize
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.python
ms-python.vscode-pylance
msjsdiag.vscode-react-native
njpwerner.autodocstring
oderwat.indent-rainbow
planbcoding.vscode-react-refactor
saoudrizwan.claude-dev
sdras.night-owl
streetsidesoftware.code-spell-checker
usernamehw.errorlens
vincaslt.highlight-matching-tag
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vue.volar
wholroyd.jinja
wix.vscode-import-cost
