anthropic.claude-code
eamodio.gitlens
esbenp.prettier-vscode
github.copilot
github.copilot-chat
github.vscode-github-actions
ms-azuretools.vscode-containers
ms-kubernetes-tools.vscode-kubernetes-tools
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
openai.chatgpt
redhat.vscode-yaml
